{"doc":"","fields":[],"enumConstants":[],"methods":[{"name":"createCustomer","paramTypes":["ca.mcgill.ecse321group1.gamestore.dto.PersonRequestDto"],"doc":" Create customer WORKING\n \n @param customerToCreate The customer to create.\n @return The created customer, including their ID.\n"},{"name":"getCustomerById","paramTypes":["int"],"doc":" Get customer by ID WORKING\n \n @param cid The primary key (customer ID) of the customer to get.\n @return The customer with the given ID.\n"},{"name":"editCustomerById","paramTypes":["int","ca.mcgill.ecse321group1.gamestore.dto.PersonRequestDto"],"doc":" Retrieves customer by ID and allows attributes to be edited. WORKING\n \n @param cid The primary key (customer ID) of the cGameStore-Backend/src/test/java/ca/mcgill/ecse321group1/gamestore/integration/CustomerIntegrationTests.javaustomer to edit.\n @param request The person resquest DTO with new username, email, password, address, and phone number.\n @return The customer with changed attributes.\n"},{"name":"deleteCustomerById","paramTypes":["int"],"doc":" Delete customer by ID\n \n @param cid The primary key (customer ID) of the staff to delete.\n"},{"name":"addGameToCustomerCartById","paramTypes":["int","int","int"],"doc":" Add quantity number of game to customer cart WORKING\n \n @param cid Customer ID of the customer you want to add the game to.\n @param gid Game ID of the game you want to add to the customer's cart.\n @param q Quantity of the game you want to add to the customer's cart.\n @return The customer with the updated cart\n"},{"name":"addGameToCustomerWishlist","paramTypes":["int","int"],"doc":" Add game to customer wishlist (game must not be already added) WORKING\n \n @param cid Customer ID of the customer you want to add the game to.\n @param gid The Video Game ID of the game you want to add to the customer's wishlist\n @return The customer with the updated wishlist\n"},{"name":"deleteGameFromCart","paramTypes":["int","int"],"doc":" Remove all copies of specific game from cart WORKING\n \n @param cid Customer CID of the customer whose cart we want to remove the game from.\n @param gid The Video Game ID of the game you want to remove from the customer's cart.\n"},{"name":"deleteGameFromWishlist","paramTypes":["int","int"],"doc":" Remove game from wishlist\n \n @param cid Customer CID of the customer whose wishlist we want to remove the game from.\n @param gid The video game ID of the game you want to remove from the customer's wishlist.\n"},{"name":"getPastOrders","paramTypes":["int"],"doc":" Return past orders of customer \n \n @param cid Customer ID of the customer whom we want to get past orders of.\n"},{"name":"clearCart","paramTypes":["int"],"doc":" Clear customer's cart\n \n @param cid Customer ID of the customer whose cart we want to clear\n"}],"constructors":[]}